{
    "title": "Privacy Policy and User Agreement",
    "lastUpdated": "December 22, 2024",
    "sections": [
        {
            "heading": "Information We Collect",
            "content": "RECALLd is designed with an unwavering commitment to user privacy. The Application implements a strict data minimization approach, explicitly stating that no personally identifiable information (PII) shall be collected, stored, or processed under any circumstances. The Application's sole data interaction occurs through the retrieval of publicly available recall information via the U.S. Food and Drug Administration's (FDA) publicly accessible Application Programming Interface (API)."
        },
        {
            "heading": "Use of FDA API",
            "content": "The Application interfaces exclusively with the FDA's public API through strictly controlled protocols. API requests are explicitly limited to the minimum information necessary for functional execution. No user-specific or personally attributable data shall be transmitted during these interactions. Each API request is engineered to ensure complete user anonymity and maintain the highest standards of data privacy."
        },
        {
            "heading": "Data Storage",
            "content": "All application-related data, including but not limited to user preferences and search history, are:
            1. Stored exclusively and permanently within the user's local device environment
            2. Completely isolated from any external transmission or access
            3. Maintained solely within the device's native storage infrastructure
            This approach ensures absolute data localization and prevents any unauthorized data access, transmission, or collection."
        },
        {
            "heading": "Notifications",
            "content": "Notification mechanisms are managed exclusively through the user's operating system infrastructure. The Application expressly disclaims any capability or intention to:
            1. Collect, process, or store any notification-related metadata
            2. Record or retain any notification interaction information
            3. Utilize notifications for any tracking, monitoring, or data collection purposes"
        },
        {
            "heading": "Data Security",
            "content": "While the Application maintains a minimal data interaction approach, comprehensive security protocols are implemented to:
            1. Prevent and detect any unauthorized access attempts
            2. Mitigate all potential security vulnerabilities
            3. Ensure continuous application integrity
            Users explicitly acknowledge and agree that no digital system can guarantee absolute security, and they assume all risks associated with using the Application."
        },
        {
            "heading": "Third-Party Links",
            "content": "The Application may contain hyperlinks to external websites, including official FDA resources. The Application hereby explicitly and irrevocably disclaims:
            1. Any and all responsibility for external site content
            2. Any liability for external site privacy practices or data handling
            3. Any warranty or guarantee regarding external site security standards
            Users acknowledge and assume all risks associated with accessing external links."
        },
        {
            "heading": "Children's Privacy",
            "content": "RECALLd is expressly and unequivocally not designed or intended for use by individuals under 13 years of age. The Application implements mandatory measures to:
            1. Prevent any intentional or incidental collection of information from minors
            2. Ensure zero data processing involving individuals under 13 years of age
            3. Maintain strict compliance with all applicable children's privacy protection standards and regulations"
        },
        {
            "heading": "Changes to This Policy",
            "content": "This Privacy Policy may be modified at our sole discretion at any time without prior notice. All modifications become immediately effective upon posting within the Application. Users explicitly acknowledge and irrevocably agree that:
            1. Continued use of the Application constitutes binding acceptance of any modified terms
            2. No additional or separate consent shall be required or requested upon policy updates
            3. Users bear sole responsibility for regularly reviewing the most current version of this Policy"
        },
        {
            "heading": "Contact Us",
            "content": "For any inquiries, clarifications, or communications regarding this Comprehensive Privacy Policy and User Agreement, please contact:

            Email: bysnapps@gmail.com

            The provision of this contact information does not create any obligation to respond and shall not be construed as a waiver of any terms within this Policy."
        }
    ]
}
