{
  "lastUpdated": "2025-05-11T12:43:35.244Z",
  "articles": [
    {
      "source": {
        "id": null,
        "name": "GlobeNewswire"
      },
      "author": "Mitolyn",
      "title": "Mitolyn Safeness Issues Arise: Do NOT Buy from Third-Party Retail Websites to Avoid Side Effects Risk",
      "description": "Consumers Warned About Counterfeit Mitolyn Products and Unverified Sellers; Experts Recommend Buying Only from Official Website to Avoid Adverse Reactions Consumers Warned About Counterfeit Mitolyn Products and Unverified Sellers; Experts Recommend Buying Onl…",
      "url": "https://www.globenewswire.com/news-release/2025/05/10/3078632/0/en/Mitolyn-Safeness-Issues-Arise-Do-NOT-Buy-from-Third-Party-Retail-Websites-to-Avoid-Side-Effects-Risk.html",
      "urlToImage": "https://ml.globenewswire.com/Resource/Download/cdbb5d48-ad74-40ad-a479-54b1f6645266",
      "publishedAt": "2025-05-10T10:00:00Z",
      "content": "Nashville, May 10, 2025 (GLOBE NEWSWIRE) -- \r\nIn This Article, You'll Discover:\r\n<ul><li>The rising popularity of Mitolyn and the growing safety concerns surrounding unauthorized purchases</li><li>A … [+45329 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Sciencebasedmedicine.org"
      },
      "author": "Kathleen Seidel",
      "title": "David Geier, Mail Order Pharmacist",
      "description": "David Geier was in the drug business. What was he selling before the FDA stepped in?\nThe post David Geier, Mail Order Pharmacist first appeared on Science-Based Medicine.",
      "url": "https://sciencebasedmedicine.org/david-geier-mail-order-pharmacist/",
      "urlToImage": "https://sciencebasedmedicine.org/wp-content/uploads/2025/05/David-Geier-ResearchGate-profile-picture-elongated-2.jpg",
      "publishedAt": "2025-05-10T07:30:00Z",
      "content": "It is well known by now that HHS Secretary Robert F. Kennedy, Jr. has appointed his long-time associateDavid A. Geier to conduct a study of a possible association between autism and vaccines.\r\nIt is … [+25133 chars]"
    },
    {
      "source": {
        "id": "the-times-of-india",
        "name": "The Times of India"
      },
      "author": "ETimes.in",
      "title": "Oats may actually be harmful for some: 5 types of people who should avoid them",
      "description": "A popular health food, Oats are known for its high fibre and heart health benefits. From overnight soaked oats to oats cheela, there are a variety of ways to have this grain. However, they may not be suitable for everyone. Despite being gluten-free, oats can …",
      "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/oats-may-actually-be-harmful-for-some-5-types-of-people-who-should-avoid-them/photostory/120971960.cms",
      "urlToImage": "https://static.toiimg.com/photo/120971975.cms",
      "publishedAt": "2025-05-10T04:30:00Z",
      "content": "Oats are naturally gluten-free, but they are often processed in factories that handle wheat, barley, or rye, too. This leads to cross-contamination and can trigger severe immune responses in people w… [+439 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "BusinessLine"
      },
      "author": "Rohit   Pajni",
      "title": "Why it is time to rethink the standards for the food we eat every day",
      "description": "Everyday staples deserve the same quality scrutiny as gourmet items, highlighting the need for transparency and accountability in food sourcing.",
      "url": "https://www.thehindubusinessline.com/economy/agri-business/why-it-is-time-to-rethink-the-standards-for-the-food-we-eat-every-day/article69562023.ece",
      "urlToImage": "https://bl-i.thgim.com/public/incoming/k8mlww/article69563359.ece/alternates/LANDSCAPE_1200/IMG_BL_-_23_09_2019_-_11_2_1_75DQJBH1.jpg",
      "publishedAt": "2025-05-10T04:15:00Z",
      "content": "Food choices have grown increasingly curated. Ingredient labels are studied, sourcing stories are celebrated, and packaging aesthetics often shape perception as much as taste. But the enthusiasm for … [+4801 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Snopes.com"
      },
      "author": "Laerke Christensen",
      "title": "USDA withdrew proposed new salmonella regulations in poultry, but that doesn't mean the bacteria will be unregulated",
      "description": "A USDA spokesperson said its most recent performance standards, set in 2016, regarding salmonella prevalence in food continue to be enforced.",
      "url": "https://www.snopes.com//fact-check/usda-salmonella-proposal-withdrawl/",
      "urlToImage": "https://mediaproxy.snopes.com/width/1200/https://media.snopes.com/2025/05/salmonella_usda_fsis_poultry.png",
      "publishedAt": "2025-05-10T01:30:00Z",
      "content": "Claim:\r\nThe U.S. Department of Agriculture will no longer require companies to limit salmonella bacteria in poultry products.\r\n<ul><li>In late April and early May 2025, social media users claimed tha… [+12415 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Freerepublic.com"
      },
      "author": "Food & Wine",
      "title": "There’s Fecal Matter in Our Drinking Water — Here's What Scientists Are Doing About It",
      "description": "Researchers have found a new way to test for water contamination. And it's thanks to our poop. In late 2024, researchers from Chungnam National University and Gyeongsang National University published their findings on a new technique for detecting fecal conta…",
      "url": "https://freerepublic.com/focus/f-backroom/4316019/posts",
      "urlToImage": null,
      "publishedAt": "2025-05-09T21:04:51Z",
      "content": "Skip to comments.\r\nTheres Fecal Matter in Our Drinking Water Here's What Scientists Are Doing About ItFood &amp; Wine ^\r\n | 5/8\r\n | Stacey Leasca\r\nPosted on 05/09/2025 2:04:51 PM PDT by nickcarraway\r… [+4933 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Biztoc.com"
      },
      "author": "newsweek.com",
      "title": "Tattoo Ink Recall Sparks Warning About Infections, Permanent Scarring",
      "description": "Voice is AI-generated. Inconsistencies may occur.\nTattoo artists and consumers are being urged to steer clear of certain Sacred Tattoo Ink products after federal testing revealed contamination with potentially dangerous bacteria.\nThe Food and Drug Administrat…",
      "url": "https://biztoc.com/x/cc9fd8e026a0ca8d",
      "urlToImage": "https://biztoc.com/cdn/cc9fd8e026a0ca8d_s.webp",
      "publishedAt": "2025-05-09T20:39:35Z",
      "content": "Voice is AI-generated. Inconsistencies may occur.Tattoo artists and consumers are being urged to steer clear of certain Sacred Tattoo Ink products after federal testing revealed contamination with po… [+141 chars]"
    },
    {
      "source": {
        "id": "newsweek",
        "name": "Newsweek"
      },
      "author": "Anna Skinner",
      "title": "Tattoo Ink Recall Sparks Warning About Infections, Permanent Scarring",
      "description": "Testing showed that two tattoo ink products revealed contamination with potentially dangerous bacteria.",
      "url": "https://www.newsweek.com/tattoo-ink-recall-sparks-warning-infection-permanent-scarring-2070412",
      "urlToImage": "https://d.newsweek.com/en/full/2642130/tattoo-ink-recall-permanent-scarring.jpg",
      "publishedAt": "2025-05-09T20:32:44Z",
      "content": "Tattoo artists and consumers are being urged to steer clear of certain Sacred Tattoo Ink products after federal testing revealed contamination with potentially dangerous bacteria.\r\nThe Food and Drug … [+3529 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "UN News"
      },
      "author": "United Nations",
      "title": "Daily Press Briefing by the Office of the Spokesperson for the Secretary-General",
      "description": "In Syria, the Office for the Coordination of Humanitarian Affairs reports that more than 670,000 people have been displaced since November 2024, while over 1 million people have returned to their areas of origin. Meanwhile, the UN and its partners continue to…",
      "url": "https://press.un.org/en/2025/deb250509.doc.htm",
      "urlToImage": null,
      "publishedAt": "2025-05-09T19:21:20Z",
      "content": "The following is a near-verbatim transcript of todays briefing by Farhan Haq, Deputy Spokesman for the Secretary-General.\r\n**Secretary-General\r\nGood afternoon, everyone.  The Secretary-General just c… [+19299 chars]"
    },
    {
      "source": {
        "id": "nbc-news",
        "name": "NBC News"
      },
      "author": "Suzy Khimm",
      "title": "FDA stalls in posting food safety warning letters amid staff cuts",
      "description": "The FDA has not published more than a dozen letters that flagged hazards at food companies, including potential contamination, two sources said.",
      "url": "https://www.nbcnews.com/health/health-news/fda-stalls-posting-food-safety-warning-letters-staff-cuts-rcna204879",
      "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250505-fda-warning-letters-lr-a0d8ed.jpg",
      "publishedAt": "2025-05-09T18:48:13Z",
      "content": "A seafood company failed to follow federal safety rules to prevent potential botulism contamination. A business was hawking dietary supplements with the misleading claim that theyd cure, treat or pre… [+4027 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Securityaffairs.com"
      },
      "author": "Pierluigi Paganini",
      "title": "A cyber attack briefly disrupted South African Airways operations",
      "description": "A cyberattack briefly disrupted South African Airways’ website, app, and systems, but core flight operations remained unaffected. South African Airways (SAA) is the national flag carrier of South Africa, the airline is wholly owned by the South African govern…",
      "url": "https://securityaffairs.com/177656/hacking/a-cyber-attack-briefly-disrupted-south-african-airways-operations.html",
      "urlToImage": "https://securityaffairs.com/wp-content/uploads/2025/05/image-15.png",
      "publishedAt": "2025-05-09T18:21:13Z",
      "content": "A cyber attack briefly disrupted South African Airways operations\r\n | Cybercriminal services target end-of-life routers, FBI warns\r\n | Russia-linked ColdRiver used LostKeys malware in recent attacks\r… [+162874 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "KCCI Des Moines"
      },
      "author": "Kristen Rogers",
      "title": "FDA approves three new natural food color additives",
      "description": "The FDA moves to healthier food options with three natural color additives",
      "url": "https://www.kcci.com/article/fda-natural-color-additives-2025/64728808",
      "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/cnn-l19jb21wb25lbnrzl2ltywdll2luc3rhbmnlcy9jbwfomhb6bxiwmdj1m2i2btbkajdzyjiz-l19jb21wb25lbnrzl2fydgljbguvaw5zdgfuy2vzl2ntywd5ntb3djawng8yn3a0njc2ymdjmzg-jpg-681e3c1b71eb1.jpg?crop=1.00xw:0.846xh;0,0.154xh&resize=1200:*",
      "publishedAt": "2025-05-09T17:56:11Z",
      "content": "WASHINGTON —The U.S. Food and Drug Administration has approved three new color additives from natural sources that will expand the palette of available colors from natural sources for manufacturers t… [+5564 chars]"
    },
    {
      "source": {
        "id": "cnn",
        "name": "CNN"
      },
      "author": "Kristen Rogers",
      "title": "3 natural food dyes approved by FDA | CNN",
      "description": "The US Food and Drug Administration has approved three new food dyes that come from natural sources.",
      "url": "https://www.cnn.com/2025/05/09/health/natural-food-dyes-fda-approved-wellness",
      "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/sipausa-11-221370104-92419064.jpg?c=16x9&q=w_800,c_fill",
      "publishedAt": "2025-05-09T17:22:36Z",
      "content": "See all topics\r\nSign up for CNNs Eat, But Better:  Mediterranean Style. Our eight-part guide shows you a delicious expert-backed eating lifestyle that will boost your health for life.\r\nThe US Food an… [+6996 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The-independent.com"
      },
      "author": "Kaleigh Werner",
      "title": "Supplement company issues urgent recall after finding potentially deadly contamination",
      "description": "Wellness brand Optimal Carnivore finds possible salmonella contamination in one of its supplements",
      "url": "https://www.the-independent.com/life-style/fda-recall-supplement-salmonella-b2748152.html",
      "urlToImage": "https://static.the-independent.com/2025/05/09/16/53/iStock-1484152323.jpg?width=1200&height=800&crop=1200:800",
      "publishedAt": "2025-05-09T16:47:34Z",
      "content": "Your support helps us to tell the story\r\nFrom reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financia… [+3707 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Science Daily"
      },
      "author": null,
      "title": "Metals and hormone-disrupting substances pose real threat to sustainable agriculture and water management in Europe",
      "description": "Metals and hormone-disrupting substances such as estrogens present a genuine risk to the sustainability of agriculture and water management in Europe. This research provides new insights into the distribution, availability, and risks associated with these pol…",
      "url": "https://www.sciencedaily.com/releases/2025/05/250509122122.htm",
      "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png",
      "publishedAt": "2025-05-09T16:21:22Z",
      "content": "The current study focused on two main areas: metals in fertilised agricultural soils and oestrogens in aquatic systems, including the Scheldt estuary. In both domains, attention was paid not only to … [+2778 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Biztoc.com"
      },
      "author": "newsweek.com",
      "title": "Trader Joe's Food Recalled in 18 States as FDA Sets Highest Warning Level",
      "description": "Voice is AI-generated. Inconsistencies may occur.\nA company product sold by Trader Joe's, the Sesame Miso Salad with Salmon, has been recalled affecting 18 states after some packages were found to possibly contain an undeclared allergen, which the Food and Dr…",
      "url": "https://biztoc.com/x/eb4fe215f48c5f94",
      "urlToImage": "https://biztoc.com/cdn/eb4fe215f48c5f94_s.webp",
      "publishedAt": "2025-05-09T14:42:12Z",
      "content": "Voice is AI-generated. Inconsistencies may occur.A company product sold by Trader Joe's, the Sesame Miso Salad with Salmon, has been recalled affecting 18 states after some packages were found to pos… [+140 chars]"
    },
    {
      "source": {
        "id": "newsweek",
        "name": "Newsweek"
      },
      "author": "Jasmine Laws",
      "title": "Trader Joe's Food Recalled in 18 States as FDA Sets Highest Warning Level",
      "description": "Milk is one of the nine major food allergens that must be declared on packaging under federal labeling laws.",
      "url": "https://www.newsweek.com/trader-joes-food-recalled-fda-warning-level-2070087",
      "urlToImage": "https://d.newsweek.com/en/full/2641649/trader-joes-recall.jpg",
      "publishedAt": "2025-05-09T14:34:33Z",
      "content": "A company product sold by Trader Joe's, the Sesame Miso Salad with Salmon, has been recalled affecting 18 states after some packages were found to possibly contain an undeclared allergen, which the F… [+3663 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Plos.org"
      },
      "author": "Bhagya Galkissa-Dewage, Jared Oremo, Simon Bunde, Oscar Oluoch Akello, Naomy Onyuka, Jeremiah Ongwara, Abhilasha Shrestha, Samuel Dorevitch",
      "title": "Monitoring SARS-CoV-2 in wastewater in Kisumu, Kenya: Association with COVID-19 case numbers",
      "description": "While wastewater-based surveillance (WBS) has proven to be effective as an early warning system for SARS-CoV-2 monitoring in high-income countries (HICs), its feasibility in low- and middle-income countries (LMICs) is challenging due to limited sewer infrastr…",
      "url": "https://journals.plos.org/water/article?id=10.1371/journal.pwat.0000339",
      "urlToImage": "https://journals.plos.org/water/article/figure/image?id=10.1371/journal.pwat.0000339.g003&size=inline",
      "publishedAt": "2025-05-09T14:00:00Z",
      "content": "Abstract\r\nWhile wastewater-based surveillance (WBS) has proven to be effective as an early warning system for SARS-CoV-2 monitoring in high-income countries (HICs), its feasibility in low- and middle… [+61805 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Plos.org"
      },
      "author": "Muhammad Asghar, Muhammad Atiq, Muhammad Usman Ali, Ghalib Ayaz Kachelo, Nasir Ahmad Khan, Khalid Naveed, Muhammad Usman, Ahmad Nawaz, Owais Iqbal, Nasir Ahmed Rajput",
      "title": "Investigating the biochemical variations in onion leaves due to purple blotch disease and its management through induced resistance",
      "description": "Purple blotch (PB), caused by Alternaria porri (Ellis) ciferri, poses a significant threat to onion crop, resulting in major economic losses in both bulb and seed production globally. The incidence of this disease underscores the critical need for an effectiv…",
      "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0323067",
      "urlToImage": "https://journals.plos.org/plosone/article/figure/image?id=10.1371/journal.pone.0323067.g010&size=inline",
      "publishedAt": "2025-05-09T14:00:00Z",
      "content": "Abstract\r\nPurple blotch (PB), caused by Alternaria porri (Ellis) ciferri, poses a significant threat to onion crop, resulting in major economic losses in both bulb and seed production globally. The i… [+45775 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Plos.org"
      },
      "author": "Biniyam Sahiledengle, Kingsley Emwinyore Agho, Yohannes Tekalegn, Degefa Gomora, Daniel Atlaw, Demisu Zenbaba, Fikreab Desta, Zinash Teferu, Girma Beressa, Telila Mesfin, Yordanos Sintayehu, Lillian Mwanri",
      "title": "Factors associated with childhood undernutrition in poor Ethiopian households: Implications for public health interventions",
      "description": "Background Childhood undernutrition is a significant public health concern linked to poverty. Despite the persistent high burden of childhood undernutrition in Ethiopia, there is a lack of robust evidence identifying factors associated with undernutrition in …",
      "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0323332",
      "urlToImage": "https://journals.plos.org/plosone/article/figure/image?id=10.1371/journal.pone.0323332.g001&size=inline",
      "publishedAt": "2025-05-09T14:00:00Z",
      "content": "Citation: Sahiledengle B, Agho KE, Tekalegn Y, Gomora D, Atlaw D, Zenbaba D, et al. (2025) Factors associated with childhood undernutrition in poor Ethiopian households: Implications for public healt… [+47542 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "GlobeNewswire"
      },
      "author": "SNS Insider pvt ltd",
      "title": "Agrochemical Tank Market to USD 2.09 Billion by 2032, Owing to Rising Demand for Efficient and Sustainable Agrochemical Storage Solutions | SNS Insider",
      "description": "The Agrochemical Tank Market is experiencing significant growth due to the increasing adoption of precision agriculture and the need for efficient storage solutions that ensure the safe handling of agrochemicals, thereby enhancing crop yields and promoting su…",
      "url": "https://www.globenewswire.com/news-release/2025/05/09/3078314/0/en/Agrochemical-Tank-Market-to-USD-2-09-Billion-by-2032-Owing-to-Rising-Demand-for-Efficient-and-Sustainable-Agrochemical-Storage-Solutions-SNS-Insider.html",
      "urlToImage": "https://ml.globenewswire.com/Resource/Download/d6272c2e-d204-41b8-b545-a6e2e24f85c2",
      "publishedAt": "2025-05-09T13:30:00Z",
      "content": "Austin, May 09, 2025 (GLOBE NEWSWIRE) -- The Agrochemical Tank Market\r\n Size was valued at USD 1.42 billion in 2023 and is expected to reach USD 2.09 billion by 2032, growing at a CAGR of 4.47% over … [+9006 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "CNET"
      },
      "author": "Lena Borrelli",
      "title": "Millions of Microplastics Are Lurking in Your Kitchen. Here's How to Get Rid of Them",
      "description": "These simple steps can drastically reduce your exposure to microplastics while cooking and eating at home.",
      "url": "https://www.cnet.com/health/millions-of-microplastics-are-lurking-in-your-kitchen-heres-how-to-get-rid-of-them/",
      "urlToImage": "https://www.cnet.com/a/img/resize/3cd127813b6328474b775ab1dd9a187f23ab4bf0/hub/2025/05/06/27011acc-9edd-41e7-936c-9f067e082e58/gettyimages-1404990797.jpg?auto=webp&fit=crop&height=675&width=1200",
      "publishedAt": "2025-05-09T12:02:00Z",
      "content": "Microplastics are everywhere -- in the air we breathe, the water we drink, the food we eat and the homes we live in. Alarming research has shown their presence in human blood, saliva and vital organs… [+8084 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Securityaffairs.com"
      },
      "author": "Pierluigi Paganini",
      "title": "Cybercriminal services target end-of-life routers, FBI warns",
      "description": "The FBI warns that attackers are using end-of-life routers to deploy malware and turn them into proxies sold on 5Socks and Anyproxy networks. The FBI released a FLASH alert warning about 5Socks and Anyproxy malicious services targeting end-of-life (EOL) route…",
      "url": "https://securityaffairs.com/177648/cyber-crime/malware-targets-end-of-life-routers.html",
      "urlToImage": "https://securityaffairs.com/wp-content/uploads/2015/02/Rule-41-google-fbi-2.jpg",
      "publishedAt": "2025-05-09T11:43:40Z",
      "content": "Cybercriminal services target end-of-life routers, FBI warns\r\n | Russia-linked ColdRiver used LostKeys malware in recent attacks\r\n | SonicWall fixed SMA 100 flaws that could be chained to execute arb… [+162804 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "GlobeNewswire"
      },
      "author": "SlimJaro",
      "title": "SlimJaro Complaints Investigated: 2025 User Reviews Tested & Verified",
      "description": "Clinically Inspired Inflammation-Focused Supplement SlimJaro Faces Real Consumer Feedback and Scientific Scrutiny—Here’s What the Data and Verified Users Reveal in 2025 Clinically Inspired Inflammation-Focused Supplement SlimJaro Faces Real Consumer Feedback …",
      "url": "https://www.globenewswire.com/news-release/2025/05/09/3078029/0/en/SlimJaro-Complaints-Investigated-2025-User-Reviews-Tested-Verified.html",
      "urlToImage": "https://ml.globenewswire.com/Resource/Download/fc31576a-dad6-4385-aa9f-24a98d3daddb",
      "publishedAt": "2025-05-09T09:47:00Z",
      "content": "LAKELAND, Fla., May 09, 2025 (GLOBE NEWSWIRE) -- \r\nIntroduction: The 2025 Weight Crisis Why So Many People Struggle to Slim Down\r\nIn 2025, individuals across all continents face one strikingly common… [+32095 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Securityaffairs.com"
      },
      "author": "Pierluigi Paganini",
      "title": "Russia-linked ColdRiver used LostKeys malware in recent attacks",
      "description": "Since early 2025, Russia-linked ColdRiver has used LostKeys malware to steal files in espionage attacks on Western governments and organizations. Google’s Threat Intelligence Group discovered LOSTKEYS, a new malware used by Russia-linked APT COLDRIVER, in rec…",
      "url": "https://securityaffairs.com/177638/apt/russia-linked-coldriver-used-lostkeys-malware-in-recent-attacks.html",
      "urlToImage": "https://securityaffairs.com/wp-content/uploads/2025/05/image-13.png",
      "publishedAt": "2025-05-09T08:41:29Z",
      "content": "Russia-linked ColdRiver used LostKeys malware in recent attacks\r\n | SonicWall fixed SMA 100 flaws that could be chained to execute arbitrary code\r\n | The LockBit ransomware site was breached, databas… [+162739 chars]"
    },
    {
      "source": {
        "id": "the-times-of-india",
        "name": "The Times of India"
      },
      "author": "Global Desk",
      "title": "Canada, US come together after salmonella contamination threat, recall Jumbo Pumpkin Seeds",
      "description": "Canada and the United States have been at loggerheads for the last few months over a host of issues. But now a health scare has forced the two neighbouring countries to toe a similar line. A famous food item - Jumbo Pumpkin Seeds - sold by Ontario-based Advan…",
      "url": "https://economictimes.indiatimes.com/news/international/canada/canada-us-come-together-after-salmonella-contamination-threat-recall-jumbo-pumpkin-seeds/articleshow/121023267.cms",
      "urlToImage": "https://img.etimg.com/thumb/msid-121023267,width-1200,height-630,imgsize-125287,overlay-economictimes/articleshow.jpg",
      "publishedAt": "2025-05-09T07:59:38Z",
      "content": "A major bacterial contamination threat in Canada has forced the country to order the recall of a famous brand of pumpkin seeds while a similar advisory has issued in the United States of America to. … [+2533 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Securityaffairs.com"
      },
      "author": "Pierluigi Paganini",
      "title": "SonicWall fixed SMA 100 flaws that could be chained to execute arbitrary code",
      "description": "SonicWall addressed three SMA 100 flaws, including a potential zero-day, that could allow remote code execution if chained. SonicWall patches three SMA 100 vulnerabilities (CVE-2025-32819, CVE-2025-32820, and CVE-2025-32821), including a potential zero-day, t…",
      "url": "https://securityaffairs.com/177626/hacking/sonicwall-fixed-sma-100-flaws-that-could-be-chained-to-execute-arbitrary-code.html",
      "urlToImage": "https://securityaffairs.com/wp-content/uploads/2020/10/SonicWall.png",
      "publishedAt": "2025-05-09T07:50:45Z",
      "content": "Russia-linked ColdRiver used LostKeys malware in recent attacks\r\n | SonicWall fixed SMA 100 flaws that could be chained to execute arbitrary code\r\n | The LockBit ransomware site was breached, databas… [+162739 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Insurance Journal"
      },
      "author": "Admin",
      "title": "How Does Food Safety Work, and What Cuts Has Trump Made?",
      "description": "Recent actions by President Donald Trump’s administration, including staff cuts at the Food and Drug Administration, have raised questions among consumers about food safety in the United States. Here is an explanation of how food safety inspection works in th…",
      "url": "https://www.insurancejournal.com/news/national/2025/05/09/822974.htm",
      "urlToImage": "https://www.insurancejournal.com/app/uploads/2018/06/food-safety.jpg",
      "publishedAt": "2025-05-09T06:40:20Z",
      "content": "Recent actions by President Donald Trump’s administration, including staff cuts at the Food and Drug Administration, have raised questions among consumers about food safety in the United States.\r\nHer… [+5818 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Antiwar.com"
      },
      "author": "John Mac Ghlionn",
      "title": "A Masterclass in Sanitized Cruelty",
      "description": "In his recent piece for The Free Press, Michael Ames accuses others – journalists, NGOs, international aid agencies – of engaging in rhetorical manipulation. Yet the irony is almost unbearable: his own article is a masterclass in precisely that. Ames purports…",
      "url": "https://original.antiwar.com/john_mac_ghlionn/2025/05/08/a-masterclass-in-sanitized-cruelty/",
      "urlToImage": "https://original.antiwar.com/wp-content/uploads/2025/05/FireShot-Pro-Webpage-Screenshot-3290-7e2f0bb7-2095-43f5-a1e0-f2be1613a517_1024x683.webp-WEBP-Image-750-×-440-pixels-substackcdn.com_.png",
      "publishedAt": "2025-05-09T04:00:14Z",
      "content": "In his recent piece for The Free Press, Michael Ames accuses others journalists, NGOs, international aid agencies of engaging in rhetorical manipulation. Yet the irony is almost unbearable: his own a… [+6112 chars]"
    },
    {
      "source": {
        "id": "the-times-of-india",
        "name": "The Times of India"
      },
      "author": "Faizan Haidar",
      "title": "From composting decor to e-vehicle baraats: Welcome to big, green Indian wedding",
      "description": "Indian luxury weddings are embracing sustainability, with couples seeking eco-conscious celebrations. Boutique hotels are catering to this demand by offering composted decor, e-vehicle baraats, and locally sourced hampers. These venues are implementing practi…",
      "url": "https://economictimes.indiatimes.com/news/india/from-composting-decor-to-e-vehicle-baraats-welcome-to-big-green-indian-wedding/articleshow/121009519.cms",
      "urlToImage": "https://img.etimg.com/thumb/msid-121009526,width-1200,height-630,imgsize-68480,overlay-economictimes/articleshow.jpg",
      "publishedAt": "2025-05-08T21:16:28Z",
      "content": "New Delhi: Composted decor, e-vehicle baraats, and tribal-made hampers... Indian luxury weddings are becoming less fat and more green, as saving the planet becomes the latest status symbol. Boutique … [+2991 chars]"
    },
    {
      "source": {
        "id": "cbc-news",
        "name": "CBC News"
      },
      "author": null,
      "title": "Jumbo pumpkin seeds recalled due to salmonella risk",
      "description": "Two pumpkin seed products from the brand Organic Traditions have been recalled.",
      "url": "https://www.cbc.ca/news/canada/british-columbia/pumpkin-seeds-recall-salmonella-1.7530064",
      "urlToImage": "https://i.cbc.ca/1.7530077.1746732132!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/organic-traditions-jumbo-pumpkin-seeds.jpg?im=Resize%3D620",
      "publishedAt": "2025-05-08T19:24:53Z",
      "content": "The Canadian Food Inspection Agency has issued a recall for jumbo pumpkin seeds from the brand Organic Traditions due to possible salmonella contamination.\r\nThe agency is warning the public not to ea… [+961 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Securityaffairs.com"
      },
      "author": "Pierluigi Paganini",
      "title": "The LockBit ransomware site was breached, database dump was leaked online",
      "description": "Lockbit ransomware group has been compromised, attackers stole and leaked data contained in the backend infrastructure of their dark web site. Hackers compromised the dark web leak site of the LockBit ransomware gang and defaced it, posting a message and a li…",
      "url": "https://securityaffairs.com/177619/cyber-crime/the-lockbit-ransomware-site-was-breached-database-dump-was-leaked-online.html",
      "urlToImage": "https://securityaffairs.com/wp-content/uploads/2025/05/image-14.png",
      "publishedAt": "2025-05-08T18:37:05Z",
      "content": "The LockBit ransomware site was breached, database dump was leaked online\r\n | Cisco fixed a critical flaw in its IOS XE Wireless Controller\r\n | U.S. CISA adds GoVision device flaws to its Known Explo… [+162589 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "GlobeNewswire"
      },
      "author": "Purerawz",
      "title": "Purerawz Under Review Best-in-Class Highest Quality SARMs & Peptides For Sale in USA by Pure Rawz",
      "description": "A Comprehensive Review of PureRawz: Third-Party Tested SARMs & Peptides for Sale in the USA, Backed by Certificates of Analysis, Transparent Sourcing, and Fast U.S. Shipping A Comprehensive Review of PureRawz: Third-Party Tested SARMs & Peptides for Sale in t…",
      "url": "https://www.globenewswire.com/news-release/2025/05/08/3077590/0/en/Purerawz-Under-Review-Best-in-Class-Highest-Quality-SARMs-Peptides-For-Sale-in-USA-by-Pure-Rawz.html",
      "urlToImage": "https://ml.globenewswire.com/Resource/Download/3b753423-d8c0-49f2-b20c-44c8ba6b14fc",
      "publishedAt": "2025-05-08T17:59:00Z",
      "content": "New York, May 08, 2025 (GLOBE NEWSWIRE) -- \r\nIn This Article, You'll Discover:\r\n<ul><li>Why do many researchers struggle to find high-quality SARMs and peptides for sale in the USA</li><li>The most c… [+43996 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Childrenshealthdefense.org"
      },
      "author": "Jennifer O'brien",
      "title": "Trump Taps Health Freedom Advocate Dr. Casey Means for Surgeon General",
      "description": "The move came after President Donald Trump at the last minute pulled the nomination of his previous choice, Dr. Janette Nesheiwat, amid concerns about her alignment with the Make America Healthy Again agenda and allegations that she misrepresented her credent…",
      "url": "https://childrenshealthdefense.org/defender/trump-taps-health-freedom-advocate-dr-casey-means-surgeon-general/",
      "urlToImage": "https://childrenshealthdefense.org/wp-content/uploads/casey-means-surgeon-general-feature.jpg",
      "publishedAt": "2025-05-08T14:02:57Z",
      "content": "President Donald Trump on Wednesday nominated Dr. Casey Means, a holistic medicine doctor, wellness influencer and supporter of the Make America Healthy Again (MAHA) movement, to serve as surgeon gen… [+6216 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "CNET"
      },
      "author": "Katie Teague",
      "title": "Mold Growing in Your Washing Machine? Eliminate It With This Hack",
      "description": "Dirty or moldy washing machine? There are a few easy ways to get your clothes and washing machine smelling fresh and clean again. And there's even a way to keep mold from coming back. Here's how.",
      "url": "https://www.cnet.com/home/kitchen-and-household/mold-growing-in-your-washing-machine-eliminate-it-with-this-hack/",
      "urlToImage": "https://www.cnet.com/a/img/resize/9afd445302b9d080453c3409d650535305b455e1/hub/2022/08/07/889e798c-0bc1-4306-ba64-2358e92419b3/gettyimages-1319060028.jpg?auto=webp&fit=crop&height=675&width=1200",
      "publishedAt": "2025-05-08T14:00:00Z",
      "content": "Picture this: You bring your dirty laundry to the washing machine, intending to catch up on chores, only to open it and get a smell you didn't expect. The odor of rotting wood, wet socks and damp ear… [+5098 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Plos.org"
      },
      "author": "Lisa Sophie Reigl, Maxson Kenneth Anyolitho, Stella Neema, Mary Amuyunzu-Nyamongo, Andrea Buhl, Jennifer Burrill, Marie Frese, Djouquou Alexise Gnahore, Eveline Hürlimann, Suzanne Lavry, Janet Masaku, Nora Monnier, Ashley Preston, Alice Sereti Sinkeet, Peter Steinmann, Alain Toh, Orkan Okan, Andrea S. Winkler, Isabelle L. Lange",
      "title": "Socio-cultural and structural barriers influencing parents’ knowledge and access to information on schistosomiasis in children around Ugandan Lakes",
      "description": "Author summary The studied lakeside communities in Uganda have limited knowledge about the transmission and prevention of schistosomiasis while simultaneously being aware of the significance of the disease. This study was conducted in preparation for the intr…",
      "url": "https://journals.plos.org/plosntds/article?id=10.1371/journal.pntd.0013050",
      "urlToImage": "https://journals.plos.org/plosntds/article/figure/image?id=10.1371/journal.pntd.0013050.g005&size=inline",
      "publishedAt": "2025-05-08T14:00:00Z",
      "content": "Citation: Reigl LS, Anyolitho MK, Neema S, Amuyunzu-Nyamongo M, Buhl A, Burrill J, et al. (2025) Socio-cultural and structural barriers influencing parents knowledge and access to information on schi… [+82415 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Securityaffairs.com"
      },
      "author": "Pierluigi Paganini",
      "title": "Cisco fixed a critical flaw in its IOS XE Wireless Controller",
      "description": "Cisco addressed a flaw in its IOS XE Wireless Controller that could enable an unauthenticated, remote attacker to upload arbitrary files. Cisco released software updates to address a vulnerability, tracked as CVE-2025-20188 (CVSS score 10), in IOS XE Wireless…",
      "url": "https://securityaffairs.com/177609/security/cisco-fixed-a-critical-flaw-in-its-ios-xe-wireless-controller.html",
      "urlToImage": "https://securityaffairs.com/wp-content/uploads/2014/07/cisco-building.jpg",
      "publishedAt": "2025-05-08T13:13:41Z",
      "content": "Cisco fixed a critical flaw in its IOS XE Wireless Controller\r\n | U.S. CISA adds GoVision device flaws to its Known Exploited Vulnerabilities catalog\r\n | Polish authorities arrested 4 people behind D… [+162511 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Forbes"
      },
      "author": "Evan Renov, Forbes Councils Member, \n Evan Renov, Forbes Councils Member\n https://www.forbes.com/councils/forbesbusinesscouncil/people/evanrenov/",
      "title": "A Family Office Playbook For Early-Stage Startup Investments",
      "description": "As family offices increasingly embrace early-stage investments in startups, they are redefining their role in funding innovation.",
      "url": "https://www.forbes.com/councils/forbesbusinesscouncil/2025/05/08/a-family-office-playbook-for-early-stage-startup-investments/",
      "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/663cd61905ce3f6dcee4ac13/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
      "publishedAt": "2025-05-08T11:15:00Z",
      "content": "Evan J. Renov, Cofounder &amp; Managing Partner at Arieli Group.\r\ngetty\r\nFamily offices have long been focused on preserving their families wealth, with many taking a conservative approach and invest… [+6637 chars]"
    },
    {
      "source": {
        "id": "fox-news",
        "name": "Fox News"
      },
      "author": "Khloe Quill",
      "title": "Why your laundry could be making you sick and what to do about it",
      "description": "Research finds the home washing of healthcare uniforms may spread superbugs as domestic machines fail to kill harmful bacteria, according to a new study.",
      "url": "https://www.foxnews.com/health/your-laundry-could-making-you-sick-what-do-about-it",
      "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2025/05/gettyimages-2165776270.jpg",
      "publishedAt": "2025-05-08T09:00:42Z",
      "content": "Tossing in a load of wash at home sounds ordinary and harmless.   \r\nBut healthcare professionals who wash their work uniforms at home may be unknowingly spreading superbugs, according to a new study.… [+3714 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Boredpanda.com"
      },
      "author": "Rugile Baltrunaite",
      "title": "“Highly Sensitive” SIL Balks After Her High Demands Get Shut Down",
      "description": "How do you handle a demanding family member with strict dietary requirements?",
      "url": "https://www.boredpanda.com/refuse-sister-in-law-stay-vegan-peanut-allergy/",
      "urlToImage": "https://www.boredpanda.com/blog/wp-content/uploads/2025/05/refuse-sister-in-law-stay-vegan-peanut-allergy-fb.png",
      "publishedAt": "2025-05-08T08:38:44Z",
      "content": "People with strict dietary requirements live a complicated life. Their enjoyment of food comes with limitations, and as someone from the outside looking in, it’s only proper to empathize with them. \r… [+3105 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Securityaffairs.com"
      },
      "author": "Pierluigi Paganini",
      "title": "U.S. CISA adds GoVision device flaws to its Known Exploited Vulnerabilities catalog",
      "description": "U.S. Cybersecurity and Infrastructure Security Agency (CISA) adds GoVision device flaws to its Known Exploited Vulnerabilities catalog. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) added Qualitia Active! Mail, Broadcom Brocade Fabric OS, a…",
      "url": "https://securityaffairs.com/177599/security/u-s-cisa-adds-govision-device-flaws-to-its-known-exploited-vulnerabilities-catalog.html",
      "urlToImage": "https://securityaffairs.com/wp-content/uploads/2020/07/CISA.jpeg",
      "publishedAt": "2025-05-08T08:04:03Z",
      "content": "U.S. CISA adds GoVision device flaws to its Known Exploited Vulnerabilities catalog\r\n | Polish authorities arrested 4 people behind DDoS-for-hire platforms\r\n | Play ransomware affiliate leveraged zer… [+162445 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Securityaffairs.com"
      },
      "author": "Pierluigi Paganini",
      "title": "Polish authorities arrested 4 people behind DDoS-for-hire platforms",
      "description": "Polish police arrested 4 people behind DDoS-for-hire platforms used in global attacks, offering takedowns for as little as €10 via six stresser services. Polish authorities arrested 4 people linked to 6 DDoS-for-hire platforms, Cfxapi, Cfxsecurity, neostress,…",
      "url": "https://securityaffairs.com/177590/cyber-crime/polish-police-arrested-4-people-behind-ddos-for-hire-platforms.html",
      "urlToImage": "https://securityaffairs.com/wp-content/uploads/2024/12/image-14.png",
      "publishedAt": "2025-05-08T07:22:05Z",
      "content": "Polish authorities arrested 4 people behind DDoS-for-hire platforms\r\n |��Play ransomware affiliate leveraged zero-day to deploy malware\r\n | Canary Exploit tool allows to find servers affected by Apach… [+162357 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Nakedcapitalism.com"
      },
      "author": "Yves Smith",
      "title": "A US or UK Hidden Hand? “How an India-Pakistan War Could Derail Central Asia’s Future”",
      "description": "Pakistan's Prime Minister Asif contends that acting as a US operative helped prime the current India-Pakistan conflict. Does he have a point?",
      "url": "https://www.nakedcapitalism.com/2025/05/a-us-or-uk-hidden-hand-how-an-india-pakistan-war-could-derail-central-asias-future.html",
      "urlToImage": null,
      "publishedAt": "2025-05-08T07:01:36Z",
      "content": "Yves here. The India-Pakistan conflict has temporarily dropped out of the top slot in international news coverage, displaced by news that the US and UK are about to announce a tariff agreement. We’ll… [+19550 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Naturalnews.com"
      },
      "author": "Laura Harris",
      "title": "Bulgur: An ancient grain that supports a healthy heart and digestion",
      "description": "Bulgur is high in fiber, plant-based protein and essential minerals like magnesium, iron and manganese. It supports heart health, digestion and blood sugar control. A 4,000-year-old staple from Mesopotamia, bulgur is valued for its long shelf life, energy den…",
      "url": "https://www.naturalnews.com/2025-05-08-bulgur-ancient-grain-supports-healthy-heart-digestion.html",
      "urlToImage": "https://www.naturalnews.com/wp-content/uploads/sites/91/2025/05/Raw-bulgur-in-wooden-bowl-1.jpg",
      "publishedAt": "2025-05-08T06:00:00Z",
      "content": "<ul><li>Bulgur is high in fiber, plant-based protein and essential minerals like magnesium, iron and manganese. It supports heart health, digestion and blood sugar control.</li><li>A 4,000-year-old s… [+6417 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "GlobeNewswire"
      },
      "author": "AquaSculpt",
      "title": "Aqua Sculpt 2025 Reviews: Pills Complaints Or Is Aqua Sculpt Legit?",
      "description": "Read honest Aqua Sculpt reviews and consumer reports (2025). Discover if Aqua Sculpt pills for weight loss ( ice water hack) are legit or have complaints. Read honest Aqua Sculpt reviews and consumer reports (2025). Discover if Aqua Sculpt pills for weight lo…",
      "url": "https://www.globenewswire.com/news-release/2025/05/08/3076808/0/en/Aqua-Sculpt-2025-Reviews-Pills-Complaints-Or-Is-Aqua-Sculpt-Legit.html",
      "urlToImage": "https://ml.globenewswire.com/Resource/Download/712211fc-9308-4418-96ef-155dbf25f4a3",
      "publishedAt": "2025-05-08T05:17:00Z",
      "content": "AURORA, Colo., May 08, 2025 (GLOBE NEWSWIRE) -- Introduction: The 2025 Weight-Loss Paradox Why Millions Are Fighting a Losing Battle Against Weight Gain\r\nIn 2025, a quiet health crisis is spreading w… [+44223 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Food Safety News"
      },
      "author": "Joe Whitworth",
      "title": "Regional foodborne disease findings prompt calls for action",
      "description": "Researchers have highlighted the significant burden of foodborne infections in Central America and the Caribbean and called for more attention on the issue in the region. A review focused on bacterial foodborne diseases in Central America and the Caribbean (C…",
      "url": "https://www.foodsafetynews.com/2025/05/regional-foodborne-disease-findings-prompt-calls-for-action/",
      "urlToImage": "https://images.bannerbear.com/direct/y0aJ23zRDdqMxX4OGl/requests/000/090/083/157/0Mn5r3E1XY0Dq2DkYWPoD9kg7/d4db37a6b247d79a0139c74f665b265ac4a7fc3d.png",
      "publishedAt": "2025-05-08T04:05:00Z",
      "content": "Researchers have highlighted the significant burden of foodborne infections in Central America and the Caribbean and called for more attention on the issue in the region.\r\nA review focused on bacteri… [+3437 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Forbes"
      },
      "author": "Chuck Brooks, Contributor, \n Chuck Brooks, Contributor\n https://www.forbes.com/sites/cognitiveworld/people/chuckbrooks/",
      "title": "The Rise of the Humanoid Robotic Machines Is Nearing.",
      "description": "The rise of the humanoid robotic machines is nearing. Robotics are now revolutionizing numerous industry sectors through the integration of artificial intelligence",
      "url": "https://www.forbes.com/sites/chuckbrooks/2025/05/07/the-rise-of-the-humanoid-robotic-machines-is-nearing/",
      "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/681bc9d78f159c7293482dbe/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
      "publishedAt": "2025-05-07T23:49:19Z",
      "content": "Futuristic humanoid robot, computer illustration\r\ngetty\r\nThe rise of the humanoid robotic machines is nearing. Robotics is now revolutionizing numerous industry sectors through the integration of art… [+9120 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "FOX 13 Tampa Bay"
      },
      "author": "Aaron Mesmer",
      "title": "Family of teen who battled gastrointestinal illness believe he caught it at South Tampa Japanese restaurant",
      "description": "A teenage boy is preparing for surgery after battling a gastrointestinal illness his family believes he caught after eating food from a South Tampa Japanese restaurant, where dozens of other customers also complained about similar symptoms.",
      "url": "https://www.fox13news.com/news/family-teen-who-battled-gastrointestinal-illness-believe-he-caught-south-tampa-japanese-restaurant",
      "urlToImage": "https://images.foxtv.com/static.fox13news.com/www.fox13news.com/content/uploads/2025/05/1280/720/sick-from-restaurant-2.jpg?ve=1&tl=1",
      "publishedAt": "2025-05-07T23:22:56Z",
      "content": "TAMPA, Fla. - A teenage boy is preparing for surgery after battling a gastrointestinal illness his family believes he caught after eating food from a South Tampa Japanese restaurant, where dozens of … [+4066 chars]"
    },
    {
      "source": {
        "id": "newsweek",
        "name": "Newsweek"
      },
      "author": "Anna Skinner",
      "title": "Map Shows Where Beers Are Most Contaminated With Chemicals: Study",
      "description": "Beers with the highest concentrations of PFAS, also known as forever chemicals, were found in two states.",
      "url": "https://www.newsweek.com/map-beers-contaminated-pfas-chemicals-2069317",
      "urlToImage": "https://d.newsweek.com/en/full/2640555/beer-pfas-contamination.jpg",
      "publishedAt": "2025-05-07T21:33:38Z",
      "content": "A new study by researchers at RTI International has found that several American beers contain measurable levels of \"forever chemicals,\" with the source traced primarily to municipal drinking water us… [+3987 chars]"
    },
    {
      "source": {
        "id": "fox-news",
        "name": "Fox News"
      },
      "author": "Peter Burke",
      "title": "Snack food recalled amid undeclared presence of almonds and sesame",
      "description": "The U.S. Food and Drug Administration said New England Village Foods has recalled its 19th Hole Snack Mix because the product may contain undeclared almonds and sesame.",
      "url": "https://www.foxnews.com/food-drink/snack-food-recalled-amid-undeclared-presence-almonds-sesame",
      "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2025/05/snack-mix-assortment-of-nuts.jpg",
      "publishedAt": "2025-05-07T19:30:47Z",
      "content": "A snack food sold in stores in the northeast has been recalled because of two undeclared allergens.\r\nNew England Village Foods is recalling all lots of 5-ounce and 10-ounce containers of its 19th Hol… [+1506 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Securityaffairs.com"
      },
      "author": "Pierluigi Paganini",
      "title": "Play ransomware affiliate leveraged zero-day to deploy malware",
      "description": "The Play ransomware gang exploited a high-severity Windows Common Log File System flaw in zero-day attacks to deploy malware. The Play ransomware gang has exploited a Windows Common Log File System flaw, tracked as CVE-2025-29824, in zero-day attacks to gain …",
      "url": "https://securityaffairs.com/177573/cyber-crime/play-ransomware-affiliate-leveraged-zero-day-to-deploy-malware.html",
      "urlToImage": "https://securityaffairs.com/wp-content/uploads/2016/11/windows-zero-day.png",
      "publishedAt": "2025-05-07T18:43:23Z",
      "content": "Play ransomware affiliate leveraged zero-day to deploy malware\r\n | Canary Exploit tool allows to find servers affected by Apache Parquet flaw\r\n | Unsophisticated cyber actors are targeting the U.S. E… [+162285 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "OilPrice.com"
      },
      "author": "James Durso",
      "title": "How an India-Pakistan War Could Derail Central Asia’s Future",
      "description": "If India and Pakistan spiral into war, there will be consequences for Central Asia. A war between Pakistan and India would likely have significant ripple effects on Central Asia, given the region's proximity to Afghanistan and flourishing economic ties across…",
      "url": "https://oilprice.com/Geopolitics/Asia/How-an-India-Pakistan-War-Could-Derail-Central-Asias-Future.html",
      "urlToImage": "https://d32r1sh890xpii.cloudfront.net/article/718x300/2025-05-07_g2fga3i9t0.jpg",
      "publishedAt": "2025-05-07T17:00:00Z",
      "content": "India attributes the attack to…\r\nKazakhstan is considering new procurement…\r\nA full-scale trade war could…\r\nBy James Durso - May 07, 2025, 12:00 PM CDTIf India and Pakistan spiral into war, there wil… [+12218 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The-independent.com"
      },
      "author": "Brittany Miller",
      "title": "Yellowstone TV series-inspired baked beans recalled over undeclared allergen",
      "description": "Vietti Food Group recalled 4,515 cases of their Yellowstone Brown Sugar Molasses Baked Beans",
      "url": "https://www.the-independent.com/life-style/baked-beans-recall-yellowstone-b2746583.html",
      "urlToImage": "https://static.the-independent.com/2025/05/07/16/51/Yellowstone-baked-beans-recall.png?trim=16,437,52,52&width=1200&height=800&crop=1200:800",
      "publishedAt": "2025-05-07T16:43:32Z",
      "content": "Your support helps us to tell the story\r\nFrom reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financia… [+3327 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "TODAY"
      },
      "author": "Lindsay Lowe",
      "title": "Baked beans recalled in 23 states due to potential ‘life-threatening’ risk",
      "description": "Yellowstone Brown Sugar Molasses Baked Beans are being recalled in 23 states due to the presence of an undeclared allergen: soy.",
      "url": "https://www.today.com/food/recall/canned-beans-recall-2025-rcna205342",
      "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1200x630_center,f_auto,q_auto:best/rockcms/2025-05/can-beans-recall-mc-2x1-250507-copy-4d0578.jpg",
      "publishedAt": "2025-05-07T16:05:51Z",
      "content": "One variety of Yellowstone-brand baked beans is being recalled due to the presence of an undeclared allergen: soy.\r\nThe Vietti Food Group, based in Nashville, Tennessee, announced it is recalling 4,5… [+2373 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "NDTV News"
      },
      "author": "Aayushi Singh Chauhan",
      "title": "Can Aspergillus Fungus Cause The Next Deadliest Outbreak?",
      "description": "The World Health Organisation (WHO) has recognised Aspergillus fumigatus as a significant threat, emphasising the need for heightened awareness and preparedness.",
      "url": "https://doctor.ndtv.com/infection/can-aspergillus-fungus-cause-the-next-deadliest-outbreak-all-you-need-to-know-8353472",
      "urlToImage": "https://c.ndtvimg.com/2025-05/q9to3opc_can-aspergillus-fungus-cause-the-next-deadliest-outbreak_625x300_07_May_25.jpg?im=FeatureCrop,algorithm=dnn,width=620,height=350",
      "publishedAt": "2025-05-07T15:00:50Z",
      "content": "As global temperatures rise, scientists are sounding the alarm about the increasing threat posed by fungal pathogens, particularly the Aspergillus species. Recent studies indicate that climate change… [+4684 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "ConsumerReports.org"
      },
      "author": "Kevin Loria",
      "title": "Cassava Flour, Chips, Bread, and More Contain High Levels of Lead - Consumer Reports",
      "description": "If you are interested in cassava as a healthy option, you'll want to choose carefully. CR explains what to know about lead in cassava-based foods.",
      "url": "https://www.consumerreports.org/health/food-contaminants/cassava-flour-chips-bread-more-contain-high-levels-of-lead-a7817220954/",
      "urlToImage": "https://article.images.consumerreports.org/image/upload/t_article_tout/v1746047880/prod/content/dam/CRO-Images-2025/Special%20Projects/CR-SP-InlineHero-Cassava-Flour-Chips-Bread-and-More-Contain-High-Levels-of-Lead-0425",
      "publishedAt": "2025-05-07T14:33:55Z",
      "content": "Several studies have found that cassava can be a significant dietary source of lead exposure in people who eat it frequently. For example, in a 2015 study in the International Journal of Environmenta… [+3007 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Securityaffairs.com"
      },
      "author": "Pierluigi Paganini",
      "title": "Canary Exploit tool allows to find servers affected by Apache Parquet flaw",
      "description": "F5 Labs researchers released a PoC tool to find servers vulnerable to the Apache Parquet vulnerability CVE-2025-30065. A working proof-of-concept exploit for the critical Apache Parquet vulnerability CVE-2025-30065 has been released by F5 Labs, allowing the i…",
      "url": "https://securityaffairs.com/177565/security/canary-exploit-tool-allows-to-find-servers-affected-by-apache-parquet-flaw.html",
      "urlToImage": "https://securityaffairs.com/wp-content/uploads/2025/04/image-7.png",
      "publishedAt": "2025-05-07T14:08:37Z",
      "content": "Canary Exploit tool allows to find servers affected by Apache Parquet flaw\r\n | Unsophisticated cyber actors are targeting the U.S. Energy sector\r\n | NSO Group must pay WhatsApp over $167M in damages … [+162218 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Plos.org"
      },
      "author": "Patranit Srijuntrapun, Issavara Sirirungruang, Chawalit Nucharoen",
      "title": "Empowering visually impaired students through innovative tools and accessible waste sorting education at the national level",
      "description": "Waste separation is a critical strategy to address the intensifying global waste crisis. However, inclusive teaching strategies for visually impaired students remain limited. This study addresses this pressing gap by implementing an innovative intervention ro…",
      "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0323171",
      "urlToImage": "https://journals.plos.org/plosone/article/figure/image?id=10.1371/journal.pone.0323171.t008&size=inline",
      "publishedAt": "2025-05-07T14:00:00Z",
      "content": "Abstract\r\nWaste separation is a critical strategy to address the intensifying global waste crisis. However, inclusive teaching strategies for visually impaired students remain limited. This study add… [+67115 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Plos.org"
      },
      "author": "Antoine Zazzo, Maël Le Corre, Nicolas Lazzerini, Charlotte Marchina, Noost Bayarkhuu, Vincent Bernard, Mathilde Cervel, Denis Fiorillo, Dominique Joly, Michel Lemoine, Philippe Telouk, François Thil, Tsagaan Turbat, Vincent Balter, Aurélie Coulon, Sébastien Lepetz",
      "title": "3000 yr-old patterns of mobile pastoralism revealed by multiple isotopes and radiocarbon dating of ancient horses from the Mongolian Altai",
      "description": "Pastoral nomadism is of great cultural and economic importance in several regions of the world today. However, documenting ancient patterns of mobility in societies where pastoralism was central is challenging and requires tailored approaches and methodologie…",
      "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0322431",
      "urlToImage": "https://journals.plos.org/plosone/article/figure/image?id=10.1371/journal.pone.0322431.g008&size=inline",
      "publishedAt": "2025-05-07T14:00:00Z",
      "content": "Citation: Zazzo A, Le Corre M, Lazzerini N, Marchina C, Bayarkhuu N, Bernard V, et al. (2025) 3000 yr-old patterns of mobile pastoralism revealed by multiple isotopes and radiocarbon dating of ancien… [+57411 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Plos.org"
      },
      "author": "Quintin Pope, Rohan Varma, Christine Tataru, Maude M David, Xiaoli Fern",
      "title": "Learning a deep language model for microbiomes: The power of large scale unlabeled microbiome data",
      "description": "Author summary Human microbiomes and their interactions with various body systems have been linked to a wide range of diseases and lifestyle variables. To understand these links, citizen science projects such as the American Gut Project (AGP) have provided la…",
      "url": "https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1011353",
      "urlToImage": "https://journals.plos.org/ploscompbiol/article/figure/image?id=10.1371/journal.pcbi.1011353.g008&size=inline",
      "publishedAt": "2025-05-07T14:00:00Z",
      "content": "Citation: Pope Q, Varma R, Tataru C, David MM, Fern X (2025) Learning a deep language model for microbiomes: The power of large scale unlabeled microbiome data. PLoS Comput Biol 21(5):\r\n e1011353.\r\nh… [+54657 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Biztoc.com"
      },
      "author": "newsweek.com",
      "title": "Salsa Recall Update As FDA Issues Risk Warning Over Contamination Fears",
      "description": "Voice is AI-generated. Inconsistencies may occur.\nA salsa product recalled in April has now been issued a Class II risk classification by the U.S. Food and Drug Administration (FDA).\nMegaMex Foods LLC, based in California, issued a voluntary recall on April 1…",
      "url": "https://biztoc.com/x/a9b7d32b6213ea11",
      "urlToImage": "https://biztoc.com/cdn/a9b7d32b6213ea11_s.webp",
      "publishedAt": "2025-05-07T13:23:57Z",
      "content": "Voice is AI-generated. Inconsistencies may occur.A salsa product recalled in April has now been issued a Class II risk classification by the U.S. Food and Drug Administration (FDA).MegaMex Foods LLC,… [+137 chars]"
    },
    {
      "source": {
        "id": "newsweek",
        "name": "Newsweek"
      },
      "author": "Matthew Robinson",
      "title": "Salsa Recall Update As FDA Issues Risk Warning Over Contamination Fears",
      "description": "A salsa product recalled in April due to the possible presence of wood has now been issued a Class II risk classification by the FDA.",
      "url": "https://www.newsweek.com/salsa-recall-cilantro-wood-pieces-megamex-foods-california-2069053",
      "urlToImage": "https://d.newsweek.com/en/full/2640066/salsa.jpg",
      "publishedAt": "2025-05-07T13:20:25Z",
      "content": "A salsa product recalled in April has now been issued a Class II risk classification by the U.S. Food and Drug Administration (FDA).\r\nMegaMex Foods LLC, based in California, issued a voluntary recall… [+2103 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Conversation Africa"
      },
      "author": "Michael Petros, Clinical Assistant Professor of Environmental and Occupational Health Sciences, University of Illinois Chicago",
      "title": "Contaminated milk from one plant in Illinois sickened thousands with ‘Salmonella’ in 1985 − as outbreaks rise in the US, lessons from this one remain true",
      "description": "The legal, political and public health consequences of the largest Salmonella outbreak in the US underscore the importance of food safety inspections and disease surveillance.",
      "url": "https://theconversation.com/contaminated-milk-from-one-plant-in-illinois-sickened-thousands-with-salmonella-in-1985-as-outbreaks-rise-in-the-us-lessons-from-this-one-remain-true-254036",
      "urlToImage": "https://images.theconversation.com/files/665920/original/file-20250505-62-ao47gl.jpg?ixlib=rb-4.1.0&rect=0%2C246%2C3000%2C1500&q=45&auto=format&w=1356&h=668&fit=crop",
      "publishedAt": "2025-05-07T12:34:53Z",
      "content": "A valve that mixed raw milk with pasteurized milk at Hillfarm Dairy may have been the source of contamination. This was the milk processing area of the plant. AP Photo/Mark Elias\r\nIn 1985, contaminat… [+5430 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "GlobeNewswire"
      },
      "author": "SlimJaro",
      "title": "Slimjaro Complaints Explained: 2025 Customer Reviews Analyzed And Verified (Pink Salt Trick Recipe for Weight Loss)",
      "description": "A comprehensive consumer report for 2025 uncovers the truth behind Slimjaro’s weight loss claims, ingredient transparency, and real user experiences A comprehensive consumer report for 2025 uncovers the truth behind Slimjaro’s weight loss claims, ingredient t…",
      "url": "https://www.globenewswire.com/news-release/2025/05/07/3076011/0/en/Slimjaro-Complaints-Explained-2025-Customer-Reviews-Analyzed-And-Verified-Pink-Salt-Trick-Recipe-for-Weight-Loss.html",
      "urlToImage": "https://ml.globenewswire.com/Resource/Download/fc31576a-dad6-4385-aa9f-24a98d3daddb",
      "publishedAt": "2025-05-07T11:44:00Z",
      "content": "LOS ANGELES, May 07, 2025 (GLOBE NEWSWIRE) -- \r\n1. The Weight of the Problem: Why Losing Weight Still Feels Impossible in 2025\r\nDespite record numbers of health trackers, digital fitness programs, an… [+41405 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Securityaffairs.com"
      },
      "author": "Pierluigi Paganini",
      "title": "Unsophisticated cyber actors are targeting the U.S. Energy sector",
      "description": "CISA, FBI, EPA, and DoE warn of cyberattacks on the U.S. Energy sector carried out by unsophisticated cyber actors targeting ICS/SCADA systems. The US cybersecurity agency CISA, the FBI, EPA, and the DoE issued a joint alert to warn of cyberattacks targeting …",
      "url": "https://securityaffairs.com/177551/security/unsophisticated-cyber-actors-are-targeting-the-u-s-energy-sector.html",
      "urlToImage": "https://securityaffairs.com/wp-content/uploads/2014/11/energy-sector.jpg",
      "publishedAt": "2025-05-07T10:44:38Z",
      "content": "Unsophisticated cyber actors are targeting the U.S. Energy sector\r\n | NSO Group must pay WhatsApp over $167M in damages for attacks on its users\r\n | U.S. CISA adds FreeType flaw to its Known Exploite… [+162139 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The-independent.com"
      },
      "author": "Emilie Lavinia",
      "title": "I drank kefir for a month and it made me feel like a superhuman – what’s the secret behind this gut-friendly drink?",
      "description": "Could this fermented drink hold the key to better health?",
      "url": "https://www.the-independent.com/health-and-fitness/what-is-kefir-b2746295.html",
      "urlToImage": "https://static.the-independent.com/2025/01/20/11/46/iStock-1888984270.jpg?trim=0,0,0,0&width=1200&height=800&crop=1200:800",
      "publishedAt": "2025-05-07T09:02:27Z",
      "content": "Your support helps us to tell the story\r\nFrom reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financia… [+8675 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Securityaffairs.com"
      },
      "author": "Pierluigi Paganini",
      "title": "NSO Group must pay WhatsApp over $167M in damages for attacks on its users",
      "description": "NSO Group must pay WhatsApp over $167M in damages for a 2019 hack targeting 1,400+ users, per U.S. jury ruling after a five-year legal battle. A U.S. jury ordered NSO Group to pay WhatsApp over $167M for using Pegasus spyware to target over 1,400 people, viol…",
      "url": "https://securityaffairs.com/177543/laws-and-regulations/nso-group-must-pay-whatsapp-over-167m-in-damages-for-attacks-on-its-users.html",
      "urlToImage": "https://securityaffairs.com/wp-content/uploads/2021/12/NSOGroup.jpeg",
      "publishedAt": "2025-05-07T08:57:08Z",
      "content": "NSO Group must pay WhatsApp over $167M in damages for attacks on its users\r\n | U.S. CISA adds FreeType flaw to its Known Exploited Vulnerabilities catalog\r\n | Samsung MagicINFO flaw exploited days af… [+162069 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The BMJ"
      },
      "author": "Hardy, M. Y., Russell, A. K., Henneken, L. M., Tanner, G., Bekes, F., Brown, I., Motyer, A., Olechnowicz, S. W. Z., Reid, H. H., Rossjohn, J., Tye-Din, J. A.",
      "title": "Purified oat protein can trigger acute symptoms linked to immune activation in coeliac disease patients but not histological deterioration",
      "description": "Background Oat ingestion in coeliac disease (CD) is generally regarded as safe but can trigger enteropathy and T cells specific for oat avenin in the gut and blood of some individuals.\n\nObjective To correlate immune and clinical outcomes to oats, purified ave…",
      "url": "https://gut.bmj.com/content/74/6/906",
      "urlToImage": "https://gut.bmj.com/sites/default/files/highwire/gutjnl/74/6.cover-source.jpg",
      "publishedAt": "2025-05-07T07:45:34Z",
      "content": "Introduction\r\nCoeliac disease (CD) is a prevalent immune-mediated enteropathy precipitated by exposure to dietary gluten.1 Central to its development are pro-inflammatory CD4+ T cells that recognise … [+11516 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Securityaffairs.com"
      },
      "author": "Pierluigi Paganini",
      "title": "U.S. CISA adds FreeType flaw to its Known Exploited Vulnerabilities catalog",
      "description": "U.S. Cybersecurity and Infrastructure Security Agency (CISA) adds FreeType flaw to its Known Exploited Vulnerabilities catalog. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) added a FreeType flaw, tracked as CVE-2025-27363 (CVSS score of 8.…",
      "url": "https://securityaffairs.com/177537/hacking/u-s-cisa-adds-freetype-flaw-to-its-known-exploited-vulnerabilities-catalog.html",
      "urlToImage": "https://securityaffairs.com/wp-content/uploads/2020/07/CISA.jpeg",
      "publishedAt": "2025-05-07T07:17:15Z",
      "content": "U.S. CISA adds FreeType flaw to its Known Exploited Vulnerabilities catalog\r\n | Samsung MagicINFO flaw exploited days after PoC exploit publication\r\n | Experts warn of a second wave of attacks target… [+161990 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "GlobeNewswire"
      },
      "author": "PrimeBiome",
      "title": "Prime Biome Reviews Fixed What Doctors Couldn’t – In Just Weeks! A Reality Based, Self Trial, Facts and Figure Which Revealed the Truth!",
      "description": "St. Petersburg, Florida, May 07, 2025 (GLOBE NEWSWIRE) -- as per studies a person's complete health depends on gut and skin health, especially in our fast-paced environment. People are most concerned about their stomach and skin issues, which can lead to mela…",
      "url": "https://www.globenewswire.com/news-release/2025/05/07/3075773/0/en/Prime-Biome-Reviews-Fixed-What-Doctors-Couldn-t-In-Just-Weeks-A-Reality-Based-Self-Trial-Facts-and-Figure-Which-Revealed-the-Truth.html",
      "urlToImage": "https://ml.globenewswire.com/Resource/Download/6db303d8-d047-4f29-8912-d18030ec396d",
      "publishedAt": "2025-05-07T06:44:00Z",
      "content": "St. Petersburg, Florida, May 07, 2025 (GLOBE NEWSWIRE) -- as per studies a person's complete health depends on gut and skin health, especially in our fast-paced environment. People are most concerned… [+24842 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Food Safety News"
      },
      "author": "Jonan Pilet",
      "title": "Over 100 children fall ill after dead snake reportedly found in Indian school meal",
      "description": "More than 100 children fell ill after consuming a school lunch where a dead snake was allegedly found, prompting India’s National Human Rights Commission (NHRC) to investigate possible food safety and human rights concerns. On April 24, at Utkramit Madhya Vid…",
      "url": "https://www.foodsafetynews.com/2025/05/over-100-children-fall-ill-after-dead-snake-reportedly-found-in-indian-school-meal/",
      "urlToImage": "https://images.bannerbear.com/direct/y0aJ23zRDdqMxX4OGl/requests/000/089/962/030/LWXrA1qRoQvEqaZn6ypMJegBj/161b4bd6bc5dd489000b9fe48e62d221fed14a1f.png",
      "publishedAt": "2025-05-07T04:01:00Z",
      "content": "More than 100 children fell ill after consuming a school lunch where a dead snake was allegedly found, prompting India’s National Human Rights Commission (NHRC) to investigate possible food safety an… [+3172 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "FDA.gov"
      },
      "author": "FDA",
      "title": "FDA Advises Consumers, Tattoo Artists, and Retailers to Avoid Using or Selling Certain Sacred Tattoo Ink Products Contaminated with Microorganisms",
      "description": "The FDA is alerting consumers, tattoo artists, and retailers of the potential for serious injury from use of tattoo inks that are contaminated with bacteria, including Pseudomonas aeruginosa.",
      "url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/fda-advises-consumers-tattoo-artists-and-retailers-avoid-using-or-selling-certain-sacred-tattoo-ink",
      "urlToImage": "https://www.fda.gov/themes/custom/preview/img/FDA-Social-Graphic.png",
      "publishedAt": "2025-05-07T04:00:00Z",
      "content": "Summary\r\nCompany Announcement Date:\r\nMay 07, 2025\r\nFDA Publish Date:\r\nMay 07, 2025\r\nProduct Type:\r\nCosmetics \r\nReason for Announcement:\r\nRecall Reason Description\r\nTattoo inks that are contaminated w… [+2972 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "NDTV News"
      },
      "author": null,
      "title": "Why Your Ginger-Garlic Paste Tastes Weird (How to Fix It)",
      "description": "We often handle and store ginger-garlic paste like amateurs, leading to spoilage, foul odour and flat flavour. If you are experiencing the same, then you are not alone.",
      "url": "https://food.ndtv.com/how-to/why-your-ginger-garlic-paste-tastes-weird-how-to-fix-it-8350040",
      "urlToImage": "https://c.ndtvimg.com/2025-05/r16b06kk_ginger-garlic_625x300_07_May_25.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675",
      "publishedAt": "2025-05-07T03:33:54Z",
      "content": "Let's take a moment to appreciate the dynamic duo in our kitchen - no, we are not talking about any fancy smart appliance or exotic spice. In fact, it is the humble jar of ginger-garlic paste. Rightl… [+5575 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "Fox News",
      "title": "Baked beans inspired by ‘Yellowstone’ TV series recalled for undeclared allergen",
      "description": "Vietti Food Group of Nashville, Tennessee, is recalling 4,515 cases of its 15-ounce cans of Yellowstone Brown Sugar Molasses Baked Beans \"due to the presence of undeclared soy,\" the FDA announced.",
      "url": "https://nypost.com/2025/05/06/us-news/baked-beans-inspired-by-yellowstone-tv-series-recalled-for-undeclared-allergen/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2025/05/103964827.jpg?quality=75&strip=all&w=1024",
      "publishedAt": "2025-05-07T02:37:15Z",
      "content": "Baked beans from a food line inspired by a popular television series have been recalled because of an undeclared allergen.\r\nVietti Food Group of Nashville, Tennessee, is recalling 4,515 cases of its … [+1542 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Wattsupwiththat.com"
      },
      "author": "Guest Blogger",
      "title": "The Renewable Energy Trap: A Warning to Nations Pursuing Blind Sustainability",
      "description": "Nations cannot afford to fall into the renewable energy trap by embracing these technologies without considering the full spectrum of their impacts. Germany’s experience with its Energiewende shows that pushing too hard for renewables can create new environme…",
      "url": "https://wattsupwiththat.com/2025/05/06/the-renewable-energy-trap-a-warning-to-nations-pursuing-blind-sustainability/",
      "urlToImage": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2025/05/Solar_panel_Nusantara_city.webp?fit=1024%2C512&ssl=1",
      "publishedAt": "2025-05-07T01:00:00Z",
      "content": "By Terry L. Headley\r\nAs the world increasingly shifts toward renewable energy, there is a growing risk that nations could fall into the “renewable energy trap.” This trap is the result of embracing a… [+11926 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Mercola.com"
      },
      "author": "Dr. Mercola",
      "title": "Are Artificial Food Dyes Safe to Eat?",
      "description": "More than 36,000 processed foods in the U.S. contain Red 40, a synthetic dye made from petroleum. Another 8,000 products include Red 3 — a known carcinogen that the U.S. Food and Drug Administration (FDA) acknowledged causes thyroid tumors in animals over thr…",
      "url": "https://articles.mercola.com/sites/articles/archive/2025/05/07/are-artificial-food-dyes-safe-to-eat.aspx",
      "urlToImage": "https://media.mercola.com/ImageServer/Public/2025/May/FB/are-artificial-food-dyes-safe-to-eat-fb.jpg",
      "publishedAt": "2025-05-07T00:00:00Z",
      "content": "Mercola proudly supports these charities and organizations. View All \r\nDisclaimer: The entire contents of this website are based upon the opinions of Dr. Mercola, unless otherwise noted. Individual a… [+1007 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Odditycentral.com"
      },
      "author": "Spooky",
      "title": "Man Suffers Burns to Stomach and Esophagus After Taking Sip of Sparkling Water",
      "description": "A 42-year-old Spanish man has been unable to ingest any food or liquids for three weeks after taking a simple sip of bottled sparkling water at a restaurant. Pablo González, a 42-year-old businessman from Salvaterra de Miño, Spain, has been hospitalized in th…",
      "url": "https://www.odditycentral.com/news/man-suffers-burns-to-stomach-and-esophagus-after-taking-sip-of-sparkling-water.html",
      "urlToImage": "https://www.odditycentral.com/wp-content/uploads/2025/05/sparkling-water.jpg",
      "publishedAt": "2025-05-06T21:51:51Z",
      "content": "A 42-year-old Spanish man has been unable to ingest any food or liquids for three weeks after taking a simple sip of bottled sparkling water at a restaurant.\r\nPablo González, a 42-year-old businessma… [+2261 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Securityaffairs.com"
      },
      "author": "Pierluigi Paganini",
      "title": "Samsung MagicINFO flaw exploited days after PoC exploit publication",
      "description": "Threat actors started exploiting a vulnerability in Samsung MagicINFO only days after a PoC exploit was published. Arctic Wolf researchers observed threat actors beginning to exploit a high-severity vulnerability, tracked as CVE-2024-7399 (CVSS score: 8.8), i…",
      "url": "https://securityaffairs.com/177529/hacking/samsung-magicinfo-vulnerability-exploited-after-poc-publication.html",
      "urlToImage": "https://securityaffairs.com/wp-content/uploads/2022/09/Samsung-logo.jpg",
      "publishedAt": "2025-05-06T17:54:39Z",
      "content": "Samsung MagicINFO flaw exploited days after PoC exploit publication\r\n | Experts warn of a second wave of attacks targeting SAP NetWeaver bug CVE-2025-31324\r\n | U.S. CISA adds Langflow flaw to its Kno… [+161910 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "GlobeNewswire"
      },
      "author": "Precedence Research",
      "title": "Surgical Staplers Market Size to Exceed USD 11.02 Bn by 2034 | Rising Demand for Minimally Invasive Surgeries Drives Growth",
      "description": "According to Precedence Research, the global surgical staplers market size was valued at USD 6.14 billion in 2025 and is expected to exceed USD 11.02 billion by 2034, marking a strong CAGR of 6.72% from 2025 to 2034, driven by increasing adoption of minimally…",
      "url": "https://www.globenewswire.com/news-release/2025/05/06/3075323/0/en/Surgical-Staplers-Market-Size-to-Exceed-USD-11-02-Bn-by-2034-Rising-Demand-for-Minimally-Invasive-Surgeries-Drives-Growth.html",
      "urlToImage": "https://ml.globenewswire.com/Resource/Download/01eb1f79-0c67-420b-b423-376619f975cd",
      "publishedAt": "2025-05-06T15:50:00Z",
      "content": "Ottawa, May 06, 2025 (GLOBE NEWSWIRE) -- In terms of revenue, the surgical staplers market is worth USD 6.14 billion in 2025 and is anticipated to reach around USD 6.56 billion in 2026. The market is… [+19928 chars]"
    },
    {
      "source": {
        "id": "fox-news",
        "name": "Fox News"
      },
      "author": "Peter Burke",
      "title": "Baked beans inspired by popular TV series recalled for undeclared allergen",
      "description": "A total of 4,515 cases of baked beans from a food line inspired by a popular television series have been recalled because of an undeclared allergen. Here are details.",
      "url": "https://www.foxnews.com/food-drink/baked-beans-inspired-popular-tv-series-recalled-undeclared-allergen",
      "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2025/05/baked-beans.jpg",
      "publishedAt": "2025-05-06T15:24:16Z",
      "content": "Baked beans from a food line inspired by a popular television series have been recalled because of an undeclared allergen.\r\nVietti Food Group of Nashville, Tennessee, is recalling 4,515 cases of its … [+1608 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Phys.Org"
      },
      "author": "University of Portsmouth",
      "title": "UK falling behind international efforts as microplastics infiltrate food, bodies, and ecosystems, warn researchers",
      "description": "The UK government must urgently draw up a comprehensive national strategy to tackle microplastic pollution or risk falling further behind international efforts to address one of the most pervasive environmental threats of our time, researchers have warned.",
      "url": "https://phys.org/news/2025-05-uk-falling-international-efforts-microplastics.html",
      "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/microplastics.jpg",
      "publishedAt": "2025-05-06T15:24:04Z",
      "content": "The UK government must urgently draw up a comprehensive national strategy to tackle microplastic pollution or risk falling further behind international efforts to address one of the most pervasive en… [+5685 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Conversation Africa"
      },
      "author": "Antaya March, Director - Global Plastics Policy Centre, University of Portsmouth, Stephanie Northen, Research Associate, Revolution Plastics, University of Portsmouth",
      "title": "The UK is falling behind in tackling microplastic pollution – here are three ways the government can catch up",
      "description": "Microplastics are accumulating in our food, water, air and bodies – yet UK regulations aren’t designed to reduce them.",
      "url": "https://theconversation.com/the-uk-is-falling-behind-in-tackling-microplastic-pollution-here-are-three-ways-the-government-can-catch-up-255465",
      "urlToImage": "https://images.theconversation.com/files/666065/original/file-20250506-56-vbx8b8.jpg?ixlib=rb-4.1.0&rect=714%2C0%2C4999%2C2499&q=45&auto=format&w=1356&h=668&fit=crop",
      "publishedAt": "2025-05-06T15:11:55Z",
      "content": "SIVStockStudio/Shutterstock\r\nMicroplastics – fragments of plastic smaller than 5mm – are accumulating in the environment. They’re found in soil, water, food, even in human lungs, placentas and blood.… [+5949 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Plos.org"
      },
      "author": "Hsiao-Yu Yang, Kai-Chieh Wen, Ping-Fang Chiu, Wan-Chin Chen, Teng-Hsiang Chang, Che-Jui Chang, Wei-Hung Hsu, Shin-Chien Chen",
      "title": "Environmental risk factors for chronic kidney disease of non-traditional causes in tropical coastal areas: A systematic review and meta-analysis",
      "description": "Chronic Kidney Disease of Non-Traditional Etiology is a Neglected Tropical Disease Influenced by Geographic Latitude and Temperature",
      "url": "https://journals.plos.org/plosntds/article?id=10.1371/journal.pntd.0013056",
      "urlToImage": "https://journals.plos.org/plosntds/article/figure/image?id=10.1371/journal.pntd.0013056.g005&size=inline",
      "publishedAt": "2025-05-06T14:00:00Z",
      "content": "Citation: Yang H-Y, Wen K-C, Chiu P-F, Chen W-C, Chang T-H, Chang C-J, et al. (2025) Environmental risk factors for chronic kidney disease of non-traditional causes in tropical coastal areas: A syste… [+35326 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Plos.org"
      },
      "author": "Quynh Huong Nguyen, Chun Heng Royce Lai, Michael J. Norris, Dixon Ng, Megha Shah, Christine Chieh-Lin Lai, David E. Isenman, Trevor F. Moraes",
      "title": "A surface lipoprotein on Pasteurella multocida binds complement factor I to promote immune evasion",
      "description": "Author summary Pasteurella multocida, a zoonotic pathogen, causes serious diseases in many animal species. This bacterial infection has a tremendous economic impact on the farming industry, especially for small holder farmers. Outbreaks of P. multocida infect…",
      "url": "https://journals.plos.org/plospathogens/article?id=10.1371/journal.ppat.1012686",
      "urlToImage": "https://journals.plos.org/plospathogens/article/figure/image?id=10.1371/journal.ppat.1012686.g007&size=inline",
      "publishedAt": "2025-05-06T14:00:00Z",
      "content": "Abstract\r\nPasteurella multocida is the leading cause of wound infections in humans following animals bites or scratches. This bacterium is also commonly found in the respiratory tract of many mammals… [+90083 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Plos.org"
      },
      "author": "Nida Saleem, Mushtaq Hussain Lashari, Hafiz Ishfaq Ahmad, Shazia Tahreem, Mikhlid H. Almutairi, Shakeel Ahmed",
      "title": "Hematological changes in the blood of experimental male and female albino rats on exposure to pesticide, dimethoate",
      "description": "Objective Evaluating pesticides’ impacts on human health, ecological balance, and agricultural production is the main focus of research on pesticides. The present study aims to investigate the hematological parameters of both genders of albino rats after expo…",
      "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0321848",
      "urlToImage": "https://journals.plos.org/plosone/article/figure/image?id=10.1371/journal.pone.0321848.g004&size=inline",
      "publishedAt": "2025-05-06T14:00:00Z",
      "content": "Citation: Saleem N, Lashari MH, Ahmad HI, Tahreem S, H. Almutairi M, Ahmed S (2025) Hematological changes in the blood of experimental male and female albino rats on exposure to pesticide, dimethoate… [+29534 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Securityaffairs.com"
      },
      "author": "Pierluigi Paganini",
      "title": "Experts warn of a second wave of attacks targeting SAP NetWeaver bug CVE-2025-31324",
      "description": "Threat actors launch second wave of attacks on SAP NetWeaver, exploiting webshells from a recent zero-day vulnerability. In April, ReliaQuest researchers warned that a zero-day vulnerability, tracked as CVE-2025-31324 (CVSS score of 10/10), in SAP NetWeaver i…",
      "url": "https://securityaffairs.com/177522/hacking/experts-warn-of-a-second-wave-of-attacks-targeting-sap-netweaver-bug-cve-2025-31324.html",
      "urlToImage": "https://securityaffairs.com/wp-content/uploads/2015/05/SAP-systems.gif",
      "publishedAt": "2025-05-06T13:55:46Z",
      "content": "Experts warn of a second wave of attacks targeting SAP NetWeaver bug CVE-2025-31324\r\n | U.S. CISA adds Langflow flaw to its Known Exploited Vulnerabilities catalog\r\n | Google fixed actively exploited… [+161838 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "International Business Times"
      },
      "author": "Madelaine Panganiban",
      "title": "Tomatoes Recalled in 14 States Over Salmonella Concerns, FDA Warns",
      "description": "Tomatoes sold in 14 states are recalled over potential salmonella contamination, FDA warns.",
      "url": "https://www.ibtimes.com/tomatoes-recalled-14-states-over-salmonella-concerns-fda-warns-3772615",
      "urlToImage": "https://d.ibtimes.com/en/full/4599001/tomatoes-recalled-14-states-over-salmonella-concerns-fda-warns.jpg",
      "publishedAt": "2025-05-06T13:17:02Z",
      "content": "The US Food and Drug Administration (FDA) has announced a recall of tomatoes sold in 14 states due to potential salmonella contamination.\r\nThe recall involves two different brands: Ray &amp; Mascari … [+2342 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Securityaffairs.com"
      },
      "author": "Pierluigi Paganini",
      "title": "U.S. CISA adds Langflow flaw to its Known Exploited Vulnerabilities catalog",
      "description": "U.S. Cybersecurity and Infrastructure Security Agency (CISA) adds Langflow flaw to its Known Exploited Vulnerabilities catalog. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) added a Langflow flaw, tracked as CVE-2025-3248 (CVSS score of 9.8…",
      "url": "https://securityaffairs.com/177481/hacking/u-s-cisa-adds-langflow-flaw-to-its-known-exploited-vulnerabilities-catalog.html",
      "urlToImage": "https://securityaffairs.com/wp-content/uploads/2020/07/CISA.jpeg",
      "publishedAt": "2025-05-06T13:00:36Z",
      "content": "U.S. CISA adds Langflow flaw to its Known Exploited Vulnerabilities catalog\r\n | Google fixed actively exploited Android flaw CVE-2025-27363\r\n | New 'Bring Your Own Installer (BYOI)' technique allows … [+161750 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "ScienceAlert"
      },
      "author": "Carly Cassella",
      "title": "Does Kissing Expose You to Gluten? Scientists Investigated The Risks",
      "description": "When someone is diagnosed with celiac disease, they have a lot of questions, but there's a common one that doctors say they get a lot: Can you kiss someone who has just eaten gluten? In recent surveys, as many as 40 percent of celiac patients say they are hes…",
      "url": "https://www.sciencealert.com/does-kissing-expose-you-to-gluten-scientists-investigated-the-risks",
      "urlToImage": "https://www.sciencealert.com/images/2024/10/kissy-lips.jpg",
      "publishedAt": "2025-05-06T12:00:27Z",
      "content": "When someone is diagnosed with celiac disease, they have a lot of questions, but there's a common one that doctors say they get a lot: Can you kiss someone who has just eaten gluten?\r\nIn recent surve… [+4111 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Biztoc.com"
      },
      "author": "newsweek.com",
      "title": "Nut Recall Update as FDA Issues Highest Risk Warning",
      "description": "The mislabeling of allergens is a leading cause of food recalls in the U.S., and can have serious or life-threatening implications for those with allergies.",
      "url": "https://biztoc.com/x/c37000abcf799bbc",
      "urlToImage": "https://biztoc.com/cdn/930/og.png",
      "publishedAt": "2025-05-06T11:51:12Z",
      "content": "The mislabeling of allergens is a leading cause of food recalls in the U.S., and can have serious or life-threatening implications for those with allergies.\r\nThis story appeared on newsweek.com, 2025… [+15 chars]"
    },
    {
      "source": {
        "id": "newsweek",
        "name": "Newsweek"
      },
      "author": "Jasmine Laws",
      "title": "Nut Recall Update as FDA Issues Highest Risk Warning",
      "description": "The mislabeling of allergens is a leading cause of food recalls in the U.S., and can have serious or life-threatening implications for those with allergies.",
      "url": "https://www.newsweek.com/nut-recall-update-fda-highest-risk-level-2068387",
      "urlToImage": "https://d.newsweek.com/en/full/2639093/peanuts-recall.jpg",
      "publishedAt": "2025-05-06T11:48:53Z",
      "content": "The recall of a mislabeled nut product distributed in two U.S. states has been updated by the Food and Drug Administration as Class I, the most serious FDA classification, due to the risk of severe a… [+3380 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "GlobeNewswire"
      },
      "author": "Bioventus, Inc.",
      "title": "Bioventus Reports First Quarter Financial Results",
      "description": "DURHAM, N.C., May 06, 2025 (GLOBE NEWSWIRE) -- Bioventus Inc. (Nasdaq: BVS) (\"Bioventus\" or the \"Company\"), a global leader in innovations for active healing, today reported financial results for the three months ended March 29, 2025.",
      "url": "https://www.globenewswire.com/news-release/2025/05/06/3074929/0/en/Bioventus-Reports-First-Quarter-Financial-Results.html",
      "urlToImage": "https://ml.globenewswire.com/Resource/Download/e10db184-593a-40b5-af02-627c27583108",
      "publishedAt": "2025-05-06T11:30:00Z",
      "content": "<ul><li>Q1 reported revenue of $123.9 million declined 4.3%; Organic* revenue advanced 5.0%</li><li>First quarter net loss was $0.04 per share compared to a loss of $0.08 in the prior-year period</li… [+51710 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Scientific American"
      },
      "author": "Cody Cottier",
      "title": "These Fish and Flies Are Engineered to Break Down Mercury",
      "description": "Bacterial genes protect animals—and their predators—from harmful contamination",
      "url": "https://www.scientificamerican.com/article/these-fish-and-flies-are-engineered-to-break-down-mercury/",
      "urlToImage": "https://static.scientificamerican.com/dam/m/efbce1f479c68b3/original/sa0525_danio_zebrafish_advances.png?m=1746211243.138&w=1200",
      "publishedAt": "2025-05-06T10:45:00Z",
      "content": "For decades mercury has been settling into lakes and oceans, where it builds up relentlessly in fish and everything that eats them—humans included. This pollution, which exposes millions of people to… [+3191 chars]"
    }
  ],
  "totalResults": 93,
  "filteredCount": 0
}